---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationFixed
source: html/b67377f5-8750-2676-c102-1acc0dcdbc64.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryZTranslationFixed Property

"Z Translation - Fixed"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryZTranslationFixed { get; }
```